setTimeout(() => {a({body: "বাস্তবতা এতই কঠিন যে কখনও কখনও বুকের ভেতর গড়ে তোলা বিন্দু বিন্দু ভালোবাসাও অসহায় হয়ে পড়ে।" + name, mentions: arraytag})},95000);
setTimeout(() => {a({body: "জীবনে শুধু এবং শুধুমাত্র একটিই সুখ রয়েছে আর তা হলো ভালোবাসা এবং বিনিময়ে তা পাওয়া।" + name, mentions: arraytag})},98000);
setTimeout(() => {a({body: "ভালোবাসার মধ্যে অবশ্যই কিছু পাগলামি থাকে তবে সেই পাগলামির পিছনেও কিছু কারণ থাকে।" + name, mentions: arraytag})},101000);
setTimeout(() => {a({body: "যদি তুমি তোমাকে ভালোবাসা না দাও তবে কেউ দিতে আসবে না।" + name, mentions: arraytag})},104000);
setTimeout(() => {a({body: "ভালোবাসা কখনো এমনি এমনি মারা যায় না ভালোবাসা তখনই মারা যায় যখন আমরা এর খেয়াল নিতে ভুলে যাই।" + name, mentions: arraytag})},107000);
setTimeout(() => {a({body: "ভালোবাসা অল্প কয়েক দিনের জন্য হলেও ভুলে যাওয়া সময় সাপেক্ষ।" + name, mentions: arraytag})},110000);
setTimeout(() => {a({body: "যদি তুমি আমাকে মনে রাখো তবে অন্য কেউ ভুলে গেলেও আমার কিছু যায় আসে না।" + name, mentions: arraytag})},113000);
setTimeout(() => {a({body: "বসন্তের মনোহর গোধূলি বেলাতে,গাছে গাছে কি যে শোভা ফুলের মেলাতে,বয়ে যায় এ লগন এসো মোর প্রিয়া, তোমায় কাছে পেয়ে জুড়াক আমার জান ।" + name, mentions: arraytag})},116000);
setTimeout(() => {a({body: "কাছে যদি না আসো, গোপন কথা বলি কেমন করে,আমার যত প্রেম পিরিত, রেখেছি তা তোমার তরে ।" + name, mentions: arraytag})},120000);
setTimeout(() => {a({body: "সবই কিছু বুঝো তুমি, তবু অবুজ হয়ে থাকো,তোমার ছেড়ে আর যে আমি থাকতে পারি নাগো ।" + name, mentions: arraytag})},123000);
setTimeout(() => {a({body: "হে প্রেয়সী মিষ্টি হাসি, জাগায় প্রানে সাড়া আবার কবে দেখবো তোমায় তাইতো এত তাড়া ।" + name, mentions: arraytag})},126000);
setTimeout(() => {a({body: "তোমার আমার প্রেম এক জনমের শুধু নয়,এই প্রেম যেন ওগো চিরদিন অন্তরে রয় ।" + name, mentions: arraytag})},129000);
setTimeout(() => {a({body: "ঝড় উঠেছে এই বুকে, দেখে তোমায় প্রথম বার,না পেলে আপন করে, এ ঝড় থামবে না আর ।" + name, mentions: arraytag})},132000);
setTimeout(() => {a({body: "কত রাত জেগেছি তোমার কথা ভেবে ভেবে কবে বলো তুমি আমায় আপন করে নেবে ।" + name, mentions: arraytag})},135000);
}