module.exports.config = {
  name: "caption",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "Islamik chat",
  description: "Islamik caption",
  commandCategory: "M H BD",
  usages: "[tag]",
  cooldowns: 5
};

module.exports.run = async ({ api, event}) => {
 const { threadID, messageID, senderID } = event;
   async function getUserInfo(userID) {
          const userInfo = await api.getUserInfo(userID);
          return {gender: userInfo[userID].gender };
   }
  const gai = ["Em có thể đi theo anh được không? Bởi vì em luôn được cha mẹ bảo là phải theo giấc mơ của mình.",

      "Bầu trời xanh, làn mây trắng. Anh yêu nắng hay yêu em?.",

      "Nhờ có nắng mới thấy cầu vồng. Nhờ có anh mới thấy màu hạnh phúc.",

      "Anh yêu ơi ới ời. Anh đang ở đâu?.",

      "Soái ca là của ngôn tình. Còn anh thì chỉ của mình em thôi.",

      "Giữa cuộc đời hàng ngàn cám dỗ.Em chỉ cần bến đỗ anh thôi.",

      "Bồ công anh bay khi có gió. Em chỉ cười vì ở đó có anh.",

      "Chỉ cần anh nói yêu, em sẽ bám theo anh suốt đời. Cô gái đang muốn muốn bật đèn xanh đấy. Cô nàng muốn gợi ý là mình chung thủy lắm đấy. Anh cứ thử tỏ tình mà xem.",

      "Ba mươi chưa phải là Tết. Không làm bạn đâu phải là hết, còn có thể làm người yêu mà.",

      "Ai nào cho mượn avatar để em đỡ cô đơn đi.",

      "Nắng đã có mũ, mưa đã có ô, còn em sẽ có ai?.",

      "Chồng tương lai ơi, em chờ anh hơi lâu rồi đấy.",

      "Trời đổ mưa rồi sao anh chưa đổ em?.",

      "Dạo này anh có thấy mỏi chân? Sao cứ đi trong tim em mãi.",

      "Anh ơi, có nóng không? Tim em đang cháy nè.",

      "Anh gì ơi ! Anh đánh rơi người yêu này.",

      "Sao anh cười mãi thế. Da em đen mất rồi.",

      "Ủa đêm rồi mà sao tim mình vẫn đầy nắng thế?.",

      "Tim anh còn chỗ không? Em muốn chuyển nhà mà chưa tìm thấy chỗ.",

      "Uống nhầm 1 ánh mắt cơn say theo cả đời!.",

      "Em thích anh còn nhiều hơn muối ở biển…",

      "Em đọc hết “Mười vạn câu hỏi vì sao” những vẫn không hiểu được vì sao em thích anh nhiều thế.",

      "Đường thì dài, chân em thì ngắn. Phải đi bao xa mới có thể tìm thấy anh.",

      "Em xinh tươi, nhưng em chưa thuộc về ai.",

      "Chán thả thính rồi, ai cưa để em đổ một lần coi.",

      "Có phải cuộc sống quá bon chen nên anh mãi vẫn chưa tìm đến em?.",

      "Nếu có thể hãy để em một lần được yêu anh, được không?.",

      "Tuổi tác với chị không quan trọng, vấn đề là em đã có bằng lái chưa?.",

      "Trăng lên đỉnh núi trăng tà. Anh yêu em thật hay là yêu chơi?.",

      "Nếu ngoài kia nhiều bão tố, thì về đây với em.",

      "Em không muốn ngủ muộn, chỉ là đang chờ ai đó chúc ngủ ngon thôi.",

      "Cây đa, giếng nước sân đinh. Khi nào em hết một mình đây anh?.",

      "Cả thế giới này ai cũng yêu nhau chỉ có riêng mình em hẩm hiu một góc.",

      "Cần ai đó quan tâm để thấy mình được yêu thương.",

      "Anh gì ơi,cho em mượn đèn pin được không? Trời tối quá, em không tìm thấy đường vào tim anh.",

      "Say rượu say bia làm gì? Anh say em đi này.",

      "Thách ai nói yêu em đấy.",

      "Em ăn BƠ muốn vỡ bụng rồi đây ạ. Làng Face ai HẢO TÂM làm ơn cứu em với. Chỉ cần cái status này 500 like, bụng em lại lành!.",

      "Lâu rồi chưa biết cảm giác được đi ăn đi xem phim như thế nào, bài vở nhiều quá. Hôm nay rảnh có ai mời không nhỉ?.",

      "Rảnh quá có ai muốn đi chơi với mình không …",

      "Này anh, anh xem hộ em xem trong mắt em có gì hộ cái. Thấy chưa, toàn là hình bóng anh đấy!.",

      "Anh biết nhiều về Thuốc Mê không? Còn em gói gọn lại đó là anh.",

      "Anh có thấy dạo này da em đen không? Vì mải nhìn nụ cười Toả Nắng của anh đấy.",

      "Xin lỗi anh gì ơi anh đi đứng kiểu gì thế ngã vào trái tim em rồi kìa!.",

      "Anh có biết cài Win không ạ? Cài hộ em cái hệ điều hành nào mà có giao diện chính là Anh được không!.",

      "Em nghĩ chúng mình có điểm chung đấy. Đó là anh yêu bản thân anh, còn em thì cũng yêu anh!.",

      "Anh gì ơi cho em mượn cái đèn pin được không. Trời tối quá em không biết đường nào để đi đến trái tim anh.",

      "Anh biết sửa Tivi không. Sao kênh nào cũng chiếu toàn những nhung nhớ về anh thế này!.",

      "Anh ơi anh có hiểu rõ đường đi lối lại ở đây không. Chỉ hộ em xem đi đường nào để thoát khỏi nỗi nhớ anh cái!.",

      "Này anh gì ơi, anh có Anh hay Em Trai gì không? Em không tin là trên đời này có tận 2 thiên thần đâu!",

      "Ai dám nói nơi hạnh phúc nhất là thiên đường. Người đó chắc hẳn không biết đến khoảnh khắc mỗi khi anh cười rồi!.",

      "Nếu không có gì là mãi mãi, anh có thể là “không có gì” của em được không?.",

      "Anh có thể cho em mượn một nụ hôn được không? Em hứa là sẽ trả lại đầy đủ."
  ];
  const trai = ["Em có muốn con mình sau này có ADN của anh không?.",

                "\n\n─༅༎•🌺🌸༅ •─\n ─༅༎•🌺🌸༅༎•─ \n যদি তুমি তোমার কথা গুলো আল্লাহ্ কে জানাতে চাও তবে নামাজ পড়💚🌺\n\nযদি তুমি আল্লাহর কথাগুলো জানতে চাও তবে কোরআন পড়📖    ─༅༎•🌺🌸༅༎•─\n\n •─༅༎•🌺🌸༅༎•─",

                "𝄞━━❝জান্নাতের নেটওয়ার্ক হলো ইসলাম❤⃞⃝࿐\n\n❥━༊༎সিম হলো ঈমান❤⃞⃝࿐\n\n  ●───༉༆বোনাস হলো রমযান❤⃞⃝࿐\n\n❥❀┈•💛🌻রিচার্জ হলো নামাজ❤⃞⃝࿐\n\n○──₪࿐আর হেল্প লাইন হলো কোরআন❤⃞⃝࿐ 🙂",

                "🌻اَلسَّلاَمْ\n\nعَلَيْــــــــــــــــــــكُمْ وَ رَحْمَةُ اللہِ وَبَرَكَاتُهُ\n🌾🥰..\n🌹আমি..কার..কাছে.. কতটা..প্রিয়🌹\n☘️সেটা.. কোন.. বিষয়..না☘️\n💞_×_💞\n⚡বরং.. আমি.. আল্লাহর.. কাছে ⚡\n🤲কতটা..প্রিয়.. সেটাই 🤲\n❣️_👇_❣️\n♣️-সবচেয়ে-বড়-বিষয়-♣️\n🌸-🤲-🌸",

                "___🌼🌷\n\n____ব্যর্থতা কেবল পারে\n\n______মানুষ কে সফলতার দিকে\n এগিয়ে আনতে\n\n_____🥀🥀❤️❤️",

                "★\n\n\n- যা আছে আলহামদুলিল্লাহ🖤🥀\n\n- আর যা নেই হবে একদিন ইনশাআল্লাহ🤲\n\n\n★",

                "তওবাঃ❤️\n\nআস্তাগফিরুল্লাহ হাল্লাজি লা ইলাহা ইল্লা হুওয়াল হাইয়্যুল কাইয়্যুম ওয়া আতুবু ইলাইহি লা হাওলা ওয়ালা কুয়্যাতা ইল্লা বিল্লাহিল  আলিয়্যিল আযীম-!!🌼\nপড়া হলে আলহামদুলিল্লাহ🖤",

                "─༅༎•🦋💫\n\n\n༄-দিন শেষে আযানের মধুর ধ্বনিতে-!!\n\n-এক গ্লাস পানিই বলে দেয়-🍺!!\n-ইসলাম কতটা শান্তির࿐🤗✨\n\n ༅༎•─🧡🌸!!,,,,,,,🥀❤️",

                "অবশ্যই তুমি পাবে যা\n হারিয়েছো \n               তার চেয়ে উত্তম কিছু ❤️❣️\n\n (সূরা আনফালঃ৭০)",

                "নিজেকে পবিত্র রাখুন😊\n\n\n--------নিশ্চয়ই আল্লাহ আপনাকে পবিত্র \n\nজিবন সঙ্গী উপহার দিবেন \n\n\n---------ইনশাআল্লাহ 😍",

                "᭄࿐-ইচ্ছে!!!গুলো!!!\nযদি!!!পবিত্র!!হয়!✿᭄\n\n ✿᭄তাহলে!!!স্বপ্ন!!! গুলো..🖤🥀\n✿᭄ ࿐- একদিন!!!পূরণ!!!হবেই!!! ✿᭄\n\n\n✿᭄࿐ইনশাআল্লাহ..🖤🥀",

                "_____✵♡︎\n\n\n___কি হবে  এত  মানুষের প্রিয় হয়ে__🦋🌻\n\n __যদি আল্লাহ  প্রিয় না হতে পারি__🙂🦋\n\n\n_____✵♡︎",

                "┏╮/╱\n╰️❥☆••\n╱/╰┛\n\n🍁࿐চিরস্থায়ী কি জানেন༒࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌\n༄আপনার সুন্দর ব্যবহার!!🍁!!࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌\n\n!࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌🍁যেটা মৃত্যুর পরও সবার সৃতিতে থাকবে🥰❁ཻ͜͡ღ᭄",

                "🦋\n\n\n-মক্কা তুমি ধন্য.༏༏😽🕋࿐\n\n-তোমার বুকে হয়েছিলো বিশ্ব নবীর জন্ম.༏༏࿐💛🙆\n\n\n🦋",

                "বাবার চেয়ে দায়িত্ববান কোনো পুরুষ হয় না_🖤\n\nমায়ের চেয়ে যত্নশীল কোনো নারী হয় না!❤️",

                "–প্রতিটি মানুষ তখনিই 𝗦𝘂𝗰𝗰𝗲𝘀𝘀𝗳𝘂𝗹 হয়☺️\n\nযখন সে কালেমা পড়ে মৃত্যুবরণ করে!🥀☺️\n #لا_اله_الا_الله_محمد_رسول_الله 💚🌺",

                "°°\n\n\n-আত্মসম্মান নষ্ট করে কারো সঙ্গে থাকার চেয়ে, আত্মসম্মান ধরে রেখে একা থাকা শ্রেয়!🖤\n\n\n°°",

                "●══❥𝄞⋆⃝🥰 ভাগ্যর ༅༎༅ উপর ༅༎༅ কারো ༅༎༅ হাত নেই ,,!!💚🌺🥀\n\n              ────😕\n🦋🌺-༅༎༅ সব ༅ ༎༅ কিছু ༅༎༅ পরিবর্তন ლ🌼\n༅༎༅ করার  মালিক  🌻😽💖\n\n🕊༎༅ একমাত্র ༅༎༅ আল্লাহ ,,,,",

                "- أَسْتَغْفِرُ اللهَ وَأَتُوْبُ إِلَيْهِ\n\n-তওবা কারিকে আল্লাহ ভালোবাসেন। ✨🖤",

                "I wish 🤗\n\nমৃত্যুর কয়েক সেকেন্ড আগে যেন প্রত্যেকটা\nমুসলমানের মুখে\nউচ্চারিত হয় !\nলা ইলাহা ইল্লাল্লাহু \n মুহাম্মাদুর রাসূলুল্লাহ ( সঃ )\n\nআমিন🤲🤲🥰",

                "︵🦋🤍\n\n___ღ༎  I wish 🥳😘\n\n★\n★\n★\n★\n★,🌺🌼🥀মৃত্যুর কয়েক সেকেন্ড আগে যেন প্রত্যেকটা\nমুসলমানের মুখে\n উচ্চারিত হয় !😇\n\n🥀লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ ( সঃ )😌\n\n আমিন🤲🤲🤗😙-ღ-࿐🦋\n\n🥰🥰🥰",

                "জ্ঞানী ব্যক্তি আগে চিন্তা করে পরে কথা বলে ,\nবোকা ব্যক্তি আগে কথা বলে পরে চিন্তা করে ।\n\n_হযরত আলী",

                "✿•𝐁𝐞𝐬𝐭 𝐋𝐢𝐧𝐞❥•࿐\n\n          ❤️❤️        \n\n                                     🖤\n\n   \n\n ❤️    لا إله إلا الله محمد رسول اللّه   💚\n\n💓লা ইলাহা ইল্লাল্লাহু \n মুহাম্মাদুর রাসুলুল্লাহ💗\n\n                                      (সঃ)",                         "🌸𝐀𝐥𝐡𝐚𝐦𝐝𝐮𝐥𝐢𝐥𝐥𝐚𝐡\nকোনো বেক্তি যখন এই বাক্যটি পড়তে থাকে, তখন বাক্যটি আকাশসমৃহ চেদ করে আল্লাহর সামনে পৌচায়ঁ!\n\nআল্লাহ তায়ালা তখন বাক্যটিকে \nবলেন স্থির হও।তখন বাক্যটি টি বলে আমি কিভাবে স্হির হবো?আমাকে যে উচ্চারণ করেচে তাকে এখনো মাপ করা হয়নি!তখন আল্লাহ তায়ালা বলেন!আমি তুমাকে এমন লোকের জিহ্বা দিয়া\nউচ্চারণ করিয়েছি । \nউচ্চারণের আগেই তাকে মাপ করে দিয়েছি।\n\n(হাদিসে কুদসী, বুখারি)\nসুবহানাআল্লাহ🌺🌷",

             "__ღ۵ ভাগ্য যদি খারাপ হতো,,,!\n\nতাহলে বিশ্ব নবীর উম্মত হয়ে জন্ম নিতাম না ,,\n  𝑰 𝒂𝒎 𝒑𝒓𝒐𝒖𝒅 𝒐𝒇 𝒃𝒆𝒄𝒖𝒔𝒆🥰\n\n ❤️𝒊 𝒂𝒎 𝒎𝒖𝒔𝒍𝒊𝒎🖤࿐",

                "🦋࿐\n\n\nহীরার চেয়েও দামি\nহযরত মুহাম্মদ (সাঃ) এর মুখের বাণী🫰🖤\n\n🦋࿐\nসুবহানাল্লাহ-🖤🥀",

                "- নিজের বিপদের কথা শক্রকে বলো না-!!🍂\n\n- সে মুখে দুঃখ প্রকাশ করবে অন্তরে উল্লাস বোধ করবে..!!💯🖤\n\n- শেখ সাদী (রাঃ)💖",

                "হঠাৎ করেই নামাজি\nহওয়া সহজ, কিন্তু নিয়মিত নামাজি হওয়া কঠিন।💚🌻\n\nআল্লাহ সবাইকে নিয়মিত নামাজি বানিয়ে দিন!🤲🖤\n\n- আমীন..!💟🍒",

                "- I wish...😍\n\n - আমার ভালোবাসার মানুষটি\n\n যেনো নামাজী ও সত্যবাদী ব্যাক্তি\nহয়.!😊❤",

                "-সমাজ বলে পরিবারের পছন্দ মতো বিয়ে করো🙂\n\n\n- আর কোরআন বলে নিজে যাকে পছন্দ করো 🤗\n\n\n- তাকে বিয়ে করো🥰( সূরা: নিসা )🥀\n- প্রতিশোধ নয়.!🙂💌\n- হ্মমা করাই ইসলামের আদর্শ.!❤️🥰\n\n- হযরত মোহাম্মদ (সাঃ)😍🤎",

                "🥀- প্রতিশোধ নয়.!🙂💌\n- হ্মমা করাই ইসলামের আদর্শ.!❤️🥰\n\n- হযরত মোহাম্মদ (সাঃ)😍🤎",

                "-সমাজ বলে পরিবারের পছন্দ মতো বিয়ে করো🙂\n\n\n- আর কোরআন বলে নিজে যাকে পছন্দ করো 🤗\n\n\n- তাকে বিয়ে করো🥰( সূরা: নিসা )",

                "😇🥀\n\n\n\nꨄ-Bᴇsᴛ SᴇɴᴛᴄɴᴄE!ఌ︎ 🥰🌻\n\n\n༆ 'Iᴀ IʟᴀʜA IʟʟᴀʟʟᴀH MᴏʜᴀᴍMᴀᴅᴜR RᴀsᴏᴏL AʟʟᴀH!! シ︎😽🥀🦋",

                "•\n\n- বাবা নামক মেরুদণ্ড-কে আল্লাহ্ দীর্ঘ বছর বাচিয়ে রাখুক..!😇🖤\n\n•", 🍒🍒🍒🍒

                "•♥️\n\nপ্রতিদিনই সুন্দর হবে যখন \nতুমি ফজরের নামাজ দিয়ে\n                           দিনটা শুরু করবে 🤲🕋\n      #ইনশাআল্লাহ \n\n•♥️",

                "~প্রসঙ্গ যখন ধর্ম নিয়ে•🥰☺️\n\n~তখন আমাদের ইসলাম ধর্ম সেরা 🖤\n\n~Alhamdulillah🌼❤️",

                "☞মানুষের প্রেমে পড়লে জীবন নষ্ট।\n ☞আল্লাহর প্রেমে পড়লে জীবন শ্রেষ্ঠ।\n\n🥰🥰alhamdulillah🥰🥰",

                "তুমি আল্লাহ কে ভয় করো দেখা দুনিয়া ও মন 2 টয় ভালোলাগবে ,,,,",

                "> 🖤𝐓𝐡𝐢𝐬  𝐚𝐛𝐨𝐮𝐭  𝐥𝐢𝐧𝐞 !-💜\n_ღღ__\n\n__°হঠাৎ একদিন মারা যাবো  আর\n তোমরা ভাব্বে 𝐎𝐅𝐅𝐋𝐢𝐍𝐄 💔🙂\n\n_ღღ",

                "- ৮০ বছরের গোনাহ মাফের দোয়া❤\n\n- আল্লাহুম্মা সল্লি আলা মুহাম্মাদিনিন নাবিউল উম্মি\n ওয়ালা আলিহি ওয়াসাল্লিম তাসলিমা’🕋\n\n- আমিন🌺 Best Your Timeline.!😊",

                "★\n\n             - যা আছে আলহামদুলিল্লাহ🖤🥀\n\n- আর যা নেই হবে একদিন\nইনশাআল্লাহ🤲\n\n    ★",

                "___🌼🌷\n\n____ব্যর্থতা কেবল পারে\n\n______মানুষ কে সফলতার দিকে\n এগিয়ে আনতে\n\n_____🥀🥀❤️❤️",

                " 🌻اَلسَّلاَمْ عَلَيْــــــــــــــــــــكُمْ وَ رَحْمَةُ اللہِ وَبَرَكَاتُه🌾🥰..\n🌹আমি..কার..কাছে.. কতটা..প্রিয়🌹\n☘️সেটা.. কোন.. বিষয়..না☘️\n💞_×_💞\n⚡বরং.. আমি.. আল্লাহর.. কাছে ⚡\n🤲কতটা..প্রিয়.. সেটাই 🤲\n❣️_👇_❣️\n♣️-সবচেয়ে-বড়-বিষয়-♣️\n🌸-🤲-🌸",

                "𝄞━━❝জান্নাতের নেটওয়ার্ক হলো ইসলাম,❤⃞⃝࿐\n\n❥━༊༎সিম হলো ঈমান❤⃞⃝࿐\n\n●───༉༆বোনাস হলো রমযান,❤⃞⃝࿐\n\n❥❀┈•💛🌻রিচার্জ হলো নামাজ,❤⃞⃝࿐\n\n○──₪࿐আর হেল্প লাইন হলো\nকোরআন❤⃞⃝࿐ 🙂",

                "•\n\n\n─༅༎•🌺🌸༅༎•─\n ─༅༎•🌺🌸༅༎•─\nযদি তুমি তোমার কথা গুলো আল্লাহ্ কে \n জানাতে চাও তবে নামাজ পড়💚🌺\n\nযদি তুমি আল্লাহর কথাগুলো জানতে চাও তবে কোরআন পড়📖    ─༅༎•🌺🌸༅༎•─ \n\n          •─༅༎•🌺🌸༅༎•─",

                "যাকে ভালোবাসলে কোন Loss নেই তিনি হলেন।\n- হযরত মুহাম্মাদ (সাঃ),,, সুবহানাল্লাহ 🥰😇🥀",

                "°\n\n\nღ༎ তুমি ফিরে যাও আল্লাহর দিকে°࿐\n༉༎সৌভাগ্য ফিরে আসবে তুমার দিকে!!😊\n\n\n°",

                "•︵🦋🌸ღ۵༎ \n___Assalamulaikum \n°\n-পাহাড়ের উপর দাঁড়িয়ে︵❝།།\nシ︎ আকাশ যতটা কাছে মনে হয়..! ☁ 😍🥀\n\n─༅༎•─ আকাশ ততোটা কাছে নয়..!😥㋛︎☻︎\n\n🌺🌼 ঠিক ---- 🍀\n༎❞⋆◯ তেমনি কিছু মানুষকে \n ︵ლ🌺 যতটা আপন মনে করা হয়..! 🙃-------------🦋\n\n🍂🍒 আসলে সে মানুষ গুলা ততোটা আপন নয়..!! 💔🥺\n°এক মাত্রো আপন জিনি তিনি হলেন আল্লাহ\n\n──۵㋛︎༊༎༊༎﹏㋛︎!🙃🍂",

                "°\n\nღ༎'তুমি ফিরে যাও আল্লাহ'র দিকে°࿐\n༉༎সৌভাগ্য ফিরে আসবে তুমার দিকে!!😊\n\n°",

                "“-সমাজ বলে পরিবারের পছন্দ মতো বিয়ে করো🙂\n\n\n- আর কোরআন বলে নিজে যাকে পছন্দ করো 🤗\n\n\n- তাকে বিয়ে করো🥰( সূরা: নিসা )",

                "🥀\n- প্রতিশোধ নয়.!🙂💌\n- হ্মমা করাই ইসলামের আদর্শ.!❤️🥰\n\n- হযরত মোহাম্মদ (সাঃ)😍🤎",

                "🦋࿐\n\nহীরার চেয়েও দামি\nহযরত মুহাম্মদ (সাঃ) এর মুখের বাণী🫰🖤\n\n🦋࿐\nসুবহানাল্লাহ-🖤🥀",

                "︵🦋🤍 \n\n___ღ༎  I wish 🥳😘\n\n★\n★\n★\n★\n★,🌺🌼🥀মৃত্যুর কয়েক সেকেন্ড আগে যেন প্রত্যেকটা\nমুসলমানের মুখের\nউচ্চারিত হয় !😇\n\n🥀লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ ( সঃ )😌\n\nআমিন🤲🤲🤗😙-ღ-࿐🦋\n\n🥰🥰🥰",

                "🦋\n\n-মক্কা তুমি ধন্য.༏༏😽🕋࿐\n\n-তোমার বুকে হয়েছিলো \nবিশ্ব নবীর জন্ম.༏༏࿐💛🙆\n\n🦋",

                "°°\n\n-আত্মসম্মান নষ্ট করে কারো সঙ্গে থাকার চেয়ে,\n আত্মসম্মান ধরে রেখে একা থাকা শ্রেয়!🖤\n\n°°",

                "–প্রতিটি মানুষ তখনিই 𝗦𝘂𝗰𝗰𝗲𝘀𝘀𝗳𝘂𝗹 হয়☺️\n\nযখন সে কালেমা পড়ে মৃত্যুবরণ করে!\n\n🥀☺️\n#لا_اله_الا_الله_محمد_رسول_الله 💚🌺",

                "তওবাঃ❤️\n\n আস্তাগফিরুল্লাহ হাল্লাজি লা ইলাহা ইল্লা হুওয়াল হাইয়্যুল কাইয়্যুম ওয়া আতুবু ইলাইহি,লা হাওলা ওয়ালা কুয়্যাতা ইল্লা বিল্লাহিল  আলিয়্যিল আযীম🌼\n\nপড়া হলে আলহামদুলিল্লাহ🖤",

                "বাবার চেয়ে দায়িত্ববান কোনো পুরুষ হয় না_🖤\n\nমায়ের চেয়ে যত্নশীল কোনো নারী হয় না!❤️",

                "___🌼🌷\n\n____ব্যর্থতা কেবল পারে,,\n\n______মানুষ কে সফলতার দিকে\n এগিয়ে আনতে\n\n_____🥀🥀❤️❤️",

                "- I wish...😍\n\n- আমার ভালোবাসার মানুষটি\n\nযেনো নামাজী ও সত্যবাদী ব্যাক্তি  হয়.!😊❤",

                "─༅༎•🦋💫,,\n\༄-দিন শেষে আযানের মধুর ধ্বনিতে-!!\n-এক গ্লাস পানিই বলে দেয়-🍺!!\n-ইসলাম কতটা শান্তির࿐🤗✨\n\n༎•─🧡🌸!!,,,,,,🥀❤️",

                "“নিশ্চই নিজের সন্তানকে উত্তম ব্যবহার শেখানো, গরিবকে শস্য দান করার চেয়েও উত্তম”–!! ❤️🌸",

                "°°\n\n-আত্মসম্মান নষ্ট করে কারো সঙ্গে থাকার চেয়ে, আত্মসম্মান ধরে রেখে একা থাকা শ্রেয়!🖤\n\n°°",

                "°°\n\n-আত্মসম্মান নষ্ট করে কারো সঙ্গে থাকার চেয়ে, আত্মসম্মান ধরে রেখে একা থাকা শ্রেয়!🖤\n\n°°",

                "°°\n\n-আত্মসম্মান নষ্ট করে কারো সঙ্গে থাকার চেয়ে, আত্মসম্মান ধরে রেখে একা থাকা শ্রেয়!🖤\n\n°°",

                "°°\n\n-আত্মসম্মান নষ্ট করে কারো সঙ্গে থাকার চেয়ে, আত্মসম্মান ধরে রেখে একা থাকা শ্রেয়!🖤\n\n°°",

                "“সত্যিকার জ্ঞানী কারা? – যারা তাদের জ্ঞানকে বাস্তবে কাজে লাগায়”–!!❤️😇",

                "“আল্লাহ্‌ আমার কাছে এই কথা প্রকাশ করেছেন যে, তোমাদের অবশ্যই বিনয়ী হতে হবে।  কেউ কারও ওপর অহংকার করবে না, এবং কেউ কারও ওপর অত্যাচার করবে না”–!!",

                "“কোন মানুষটি আল্লাহর কাছে সবচেয়ে প্রিয়? – যার মাধ্যমে আল্লাহ্‌র অন্য সৃষ্টিকূল উপকৃত হয়”–!!🌸💙",                  

];
var mention = Object.keys(event.mentions);
 const data = await getUserInfo(senderID);
if (Object.keys(event.mentions).length == 1) {
  if (data.gender == 2 ) {
      api.sendMessage(`Gửi lời thả thính đến ${event.mentions[on].replace("@", "")}:\n${trai[Math.floor(Math.random() * trai.length)]}`,threadID, messageID);
  }
  if (data.gender == 1 ) {
      api.sendMessage(`Gửi lời thả thính đến ${event.mentions[mention].replace("@", "")}:\n${gai[Math.floor(Math.random() * gai.length)]}`, threadID, messageID);
  }
}
else {
  if (data.gender == 2) {
   api.sendMessage(`${trai[Math.floor(Math.random() * trai.length)]}`,threadID, messageID); 
  }
  if (data.gender == 1 ) {
   api.sendMessage(`${gai[Math.floor(Math.random() * gai.length)]}`, threadID, messageID);
  }
}

                }