module.exports.config = {
	name: "termux",
	version: "1.0.1", 
	hasPermssion: 0,
	credits: "BADOL-KHAN", //don't change the credits please
	description: "Termux inf",
	commandCategory: "...",
	cooldowns: 1,
	dependencies: 
	{
    "request":"",
    "fs-extra":"",
    "axios":""
  }
};
module.exports.run = async function({ api,event,args,client,Users,Threads,__GLOBAL,Currencies }) {
const axios = global.nodemodule["axios"];
const request = global.nodemodule["request"];
const fs = global.nodemodule["fs-extra"];
const time = process.uptime(),
		hours = Math.floor(time / (60 * 60)),
		minutes = Math.floor((time % (60 * 60)) / 60),
		seconds = Math.floor(time % 60);
const moment = require("moment-timezone");
var juswa = moment.tz("Asia/Dhaka").format("『D/MM/YYYY』 【hh:mm:ss】");
var link = ["https://i.imgur.com/3TOknP1.jpg",
            "https://i.imgur.com/IWUMdoL.jpg",
            
"https://i.imgur.com/O3MAiKX.jpg"];var callback = () => api.sendMessage({body:`termux-setup-storage →Termux App এ স্টোরেজ পারমিশন দিতে।

mkdir Folder →Termux App এ কোন ফোল্ডার তৈরি করতে। 
[mkdir= make directory]

rm -rf folder name কোন ফোল্ডার ডিলিট করতে...? 

touch file →Termux App এ 
কোন ফাইল তৈরি করতে।

Is→Termux App এ কোন কোন ফাইল এবং ফোল্ডার আছে তা দেখতে। [cat]

cd Folder-> কোন ফোল্ডারে প্রবেশ করতে।
cd .. → পূর্বের ফোল্ডারে বেক আসতে।
cd ~ →হোম ডিরেক্টারিতে বেক আসতে।
[ cd $HOME এটা দিয়ে ও বেক আসা যাবে ]
cd /sdcard→ফোনের ইন্টারনাল 
স্টোরেজে যেতে।
[cd= change directory]
***
অনেকের প্রশ্ন থাকে, ভাই টারমুক্স ইনস্টল করছি, এখন কি করবো? 

তো এই প্রশ্নটার উত্তরই দেয়ার চেষ্টা করব আমি।

প্রথমত, টারমাক্স ইন্সটল করেই কারো আইডি হ্যাক করা বা হ্যাকার হয়ে যাওয়ার চিন্তা থাকলে তা বাদ দেন। আগে শেখার উপর ফোকাস করেন।

এখন আসি টারমাক্স এর ব্যাপারে, টারমাক্স সম্পর্কে জানতে হলে আপনাকে প্রথমে লিনাক্স সম্পর্কে জানতে হবে।

✅ লিনাক্স কি?
লিনাক্স আসলে কোন অপারেটিং সিস্টেম নয়, এটি মূলত একটি কার্নেল—বলতে পারেন, যেকোনো অপারেটিং সিস্টেমের এটি হার্ট, কেনোনা কার্নেল কম্পিউটার হার্ডওয়্যার এবং সফটওয়্যারের মধ্যে সম্পর্ক স্থাপন করতে সাহায্য করে। যদি সহজ ভাষায় বলতে চেষ্টা করি, অবশ্যই লিনাক্স উইন্ডোজের মতোই একটি কমপ্লিট সিস্টেম, যেটার সাহায্যে কম্পিউটার নিয়ন্ত্রন করা সম্ভব। তবে টেকনিক্যালি এটি উইন্ডোজ থেকেও বেশি কিছু। লিনাক্সকে একটি ইঞ্জিন বলতে পারেন, যেটি আলাদা অনেক অপারেটিং সিস্টেম চালানোর জন্য পাওয়ার প্রদান করে থাকে। 
লিনাক্সের উপর তৈরি অপারেটিং সিস্টেম গুলোকে ডিস্ট্রিবিউশন বা সংক্ষেপে ডিস্ট্রো বলা হয়, যেমন- উবুন্টু, লিনাক্স মিন্ট, রেড হ্যাট, ফেডোরা, ইত্যাদি।
বর্তমানে হ্যাকারদের বহুল ব্যাবহৃত Kali linux, Black arch, Patrrot এগুলোও লিনাক্স ডিস্ট্রো।

আমারা যেই এনড্রয়েড অপরেটিং সিস্টেম ব্যাবহার করছি এটার ও কার্নেল বা এই অপরেটিং সিস্টেম এর কোর ও কিন্তু লিনাক্স ই।(এন্ড্রয়েড হলো লিনাক্সের উপর রান হওয়া একটি ভার্চুয়াল মেশিন)

✅ এবার আমাদের লিনাক্স আরো ভালো করে বোঝার জন্য বুঝতে হবে কমান্ড লাইন ইন্টারফেস(CLI) এবং গ্রাফিকাল ইউজার ইন্টারফেস(GUI) সম্পর্কে।

গ্রাফিক্যাল ইউজার ইন্টারফেস হল এমন এক ধরনের পদ্ধতি যা ইউজারকে ইলেকট্রনিক যন্ত্র বা হার্ডওয়ার ব্যবহারের সুযোগ দেয় চিত্রের মাধ্যমে, অন্যদিকে কমান্ডলাইন ইন্টারফেসে যা হয় কমান্ডের মাধ্যমে। 
এটা সংজ্ঞা দিয়ে বোঝানোর চেয়ে উদাহরণ দিয়ে বোঝানোর বেশি সহজ হবে, 

আমরা যখন এন্ড্রয়েডে কোন একটা অ্যাপ ওপেন করতে চাই অথবা অন্য যে কোন একটা ফোল্ডার ওপেন করতে চাই, তখন আমরা কি করি? 
আমরা জাস্ট সিম্পলি অ্যাপ এর আইকন ফোল্ডারের আইকন এর উপরে ক্লিক করি,এই আইকনকেই মূলত চিত্র বলা হয়েছে। 
আমরা যখন এই অ্যান্ড্রয়েডে যেকোন আইকনের উপর ক্লিক করছি,তখন কিন্তু আমাদের উইন্ডোজ ও অ্যান্ড্রয়েড অপারেটিং সিস্টেমের যে কার্নেল রয়েছে অর্থাৎ লিনাক্স কার্নেল, সেই কারণে কার্নেলে কিন্তু একটা কমান্ড রান হয় যেটা আমরা সাধারণত দেখতে পারিনা।তবে কাজটা মূলত কমান্ডের মাধ্যমেই হয়। 

কিন্তু আমরা এটাকে ব্যবহার করে চিত্রের মাধ্যমে বা গ্রাফিক্যাল ইন্টারফেস(GUI) এর মাধ্যমে।

অন্যদিকে কমান্ডলাইন ইন্টারফেস(CLI) হলো এখানে সব ধরনের কাজ গ্রাফিক্যাল ইন্টারফেস এর মাধ্যমে না করে কমান্ডের মাধ্যমে করা হয়। 

আমাদের ব্যবহৃত লিনাক্স ডিস্ট্রো গুলোতে আমরা CLI এবং GUI দুটই দেখতে পাই, তবে এখানে CLI এর ব্যাবহার ই বেশি।

✅ টার্মিনাল কি?

একটি লিনাক্স ডিস্ট্রো কে অপারেট করার জন্য আমরা যেই অ্যাপ্লিকেশনে কমান্ডগুলো ইনপুট দিয়ে থাকি এবং প্রয়োগ করে থাকি সেটাকেই বলা হয় টার্মিনাল। 
সোজাসুজি বলতে গেলে আমরা কমান্ডগুলো যেখানে লিখি সেটাই হচ্ছে টার্মিনাল। 

এখন আসি টারমাক্স এর ব্যপ্যারে😴
এখন যদি আপনাকে জিজ্ঞেস করা হয় টারমাক্স কি?

✅ টার্মাক্স একটি অ্যান্ড্রয়েড টার্মিনাল এমুলেটর এবং লিনাক্স এনভায়রনমেন্ট অ্যাপ্লিকেশন যা কোনও রুটিং বা সেটআপের প্রয়োজন ছাড়া সরাসরি কাজ করে।
অর্থাৎ টারমাক্স একটা টার্মিনাল যা আপনাকে লিনাক্সের কমান্ডগুলো এক্সিকিউট করার সুযোগ দিচ্ছে আপনার এন্ড্রয়েডের মাধ্যমে। 

টারমাক্স আপনি কেন ইউজ করবেন?
আপনি যদি ইথিক্যাল হ্যাকিং, পেনটেস্টিং ইত্যাদিতে আগ্রহী হয় অথবা আপনি যদি লিনাক্স ডিট্রো এর ব্যাবহার শিখতে চান তাহলেই আপনি টার্মাক্স ব্যাবহার করুন।

এতক্ষণ যা বলেছি তা থেকে হয়তো বুঝতেই পারছেন যে টারমাক্স এ সব কাজ আমাদের কমান্ড এর মাধ্যমে করতে হবে, তো এখন কমান্ড নিয়ে কিছু কথা বলি,

[আপনারা চাইলে নিচের এই অংশটি skip করতে পারেন,তবে কারো ভবিষ্যতে shell scripting শেখার ইচ্ছা থাকলে পড়তে পারেন।

$ rm -rf filename

এটা হলো কোন ফাইল রিমুভ বা ডিলিট করার কমান্ড, 
আমরা সাধারণত এর সম্পূর্ণ অংশটাকেই কমান্ড বলে থাকি, কিন্তু আসলে সম্পূর্ণ অংশটাই কমান্ড নয়, 
এখানে, rm হচ্ছে কমান্ড, যার দ্বারা remove বুঝায়। 
এরপর -rf এটাত কমান্ড না এটাকে বলা হয়- ফ্লাগ,যা কমান্ড কে মডিফাই করে, এখানে -rf দ্বারা force remove বুঝাচ্ছে, নরমালি সব ফাইল আপনি $ rm filename এই কমান্ড দ্বারাই রিমুভ করতে পারি, কিন্তু কিছু ফাইল বা ফোল্ডার রিমুভ করতে বিভিন্ন পারমিশন এর প্রয়োজন হয়, সেইক্ষেত্রে কোন পারমিশন ছাড়া রিমুভ করতে -rf ফ্লাগ ইউজ করা হয়।
☘️𝐁 𝐀 𝐃 𝐎 𝐋^𝐁 𝐎 𝐓^0 0 7🌺`,attachment: fs.createReadStream(__dirname + "/cache/juswa.jpg")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/juswa.jpg")); 
      return request(encodeURI(link[Math.floor(Math.random() * link.length)])).pipe(fs.createWriteStream(__dirname+"/cache/juswa.jpg")).on("close",() => callback());
   };